rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_NVIC.h
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI75_SHIFT)) & S32_NVIC_IP_PRI75_MASK)
#define S32_NVIC_IP_PRI76_MASK 0xFFu
#define S32_NVIC_IP_PRI76_SHIFT 0u
#define S32_NVIC_IP_PRI76_WIDTH 8u
#define S32_NVIC_IP_PRI76(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI76_SHIFT)) & S32_NVIC_IP_PRI76_MASK)
#define S32_NVIC_IP_PRI77_MASK 0xFFu
#define S32_NVIC_IP_PRI77_SHIFT 0u
#define S32_NVIC_IP_PRI77_WIDTH 8u
#define S32_NVIC_IP_PRI77(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI77_SHIFT)) & S32_NVIC_IP_PRI77_MASK)
#define S32_NVIC_IP_PRI78_MASK 0xFFu
#define S32_NVIC_IP_PRI78_SHIFT 0u
#define S32_NVIC_IP_PRI78_WIDTH 8u
#define S32_NVIC_IP_PRI78(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI78_SHIFT)) & S32_NVIC_IP_PRI78_MASK)
#define S32_NVIC_IP_PRI79_MASK 0xFFu
#define S32_NVIC_IP_PRI79_SHIFT 0u
#define S32_NVIC_IP_PRI79_WIDTH 8u
#define S32_NVIC_IP_PRI79(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI79_SHIFT)) & S32_NVIC_IP_PRI79_MASK)
#define S32_NVIC_IP_PRI80_MASK 0xFFu
#define S32_NVIC_IP_PRI80_SHIFT 0u
#define S32_NVIC_IP_PRI80_WIDTH 8u
#define S32_NVIC_IP_PRI80(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI80_SHIFT)) & S32_NVIC_IP_PRI80_MASK)
#define S32_NVIC_IP_PRI81_MASK 0xFFu
#define S32_NVIC_IP_PRI81_SHIFT 0u
#define S32_NVIC_IP_PRI81_WIDTH 8u
#define S32_NVIC_IP_PRI81(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI81_SHIFT)) & S32_NVIC_IP_PRI81_MASK)
#define S32_NVIC_IP_PRI82_MASK 0xFFu
#define S32_NVIC_IP_PRI82_SHIFT 0u
#define S32_NVIC_IP_PRI82_WIDTH 8u
#define S32_NVIC_IP_PRI82(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI82_SHIFT)) & S32_NVIC_IP_PRI82_MASK)
#define S32_NVIC_IP_PRI83_MASK 0xFFu
#define S32_NVIC_IP_PRI83_SHIFT 0u
#define S32_NVIC_IP_PRI83_WIDTH 8u
#define S32_NVIC_IP_PRI83(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI83_SHIFT)) & S32_NVIC_IP_PRI83_MASK)
#define S32_NVIC_IP_PRI84_MASK 0xFFu
#define S32_NVIC_IP_PRI84_SHIFT 0u
#define S32_NVIC_IP_PRI84_WIDTH 8u
#define S32_NVIC_IP_PRI84(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI84_SHIFT)) & S32_NVIC_IP_PRI84_MASK)
#define S32_NVIC_IP_PRI85_MASK 0xFFu
#define S32_NVIC_IP_PRI85_SHIFT 0u
#define S32_NVIC_IP_PRI85_WIDTH 8u
#define S32_NVIC_IP_PRI85(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI85_SHIFT)) & S32_NVIC_IP_PRI85_MASK)
#define S32_NVIC_IP_PRI86_MASK 0xFFu
#define S32_NVIC_IP_PRI86_SHIFT 0u
#define S32_NVIC_IP_PRI86_WIDTH 8u
#define S32_NVIC_IP_PRI86(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI86_SHIFT)) & S32_NVIC_IP_PRI86_MASK)
#define S32_NVIC_IP_PRI87_MASK 0xFFu
#define S32_NVIC_IP_PRI87_SHIFT 0u
#define S32_NVIC_IP_PRI87_WIDTH 8u
#define S32_NVIC_IP_PRI87(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI87_SHIFT)) & S32_NVIC_IP_PRI87_MASK)
#define S32_NVIC_IP_PRI88_MASK 0xFFu
#define S32_NVIC_IP_PRI88_SHIFT 0u
#define S32_NVIC_IP_PRI88_WIDTH 8u
#define S32_NVIC_IP_PRI88(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI88_SHIFT)) & S32_NVIC_IP_PRI88_MASK)
#define S32_NVIC_IP_PRI89_MASK 0xFFu
#define S32_NVIC_IP_PRI89_SHIFT 0u
#define S32_NVIC_IP_PRI89_WIDTH 8u
#define S32_NVIC_IP_PRI89(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI89_SHIFT)) & S32_NVIC_IP_PRI89_MASK)
#define S32_NVIC_IP_PRI90_MASK 0xFFu
#define S32_NVIC_IP_PRI90_SHIFT 0u
#define S32_NVIC_IP_PRI90_WIDTH 8u
#define S32_NVIC_IP_PRI90(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI90_SHIFT)) & S32_NVIC_IP_PRI90_MASK)
#define S32_NVIC_IP_PRI91_MASK 0xFFu
#define S32_NVIC_IP_PRI91_SHIFT 0u
#define S32_NVIC_IP_PRI91_WIDTH 8u
#define S32_NVIC_IP_PRI91(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI91_SHIFT)) & S32_NVIC_IP_PRI91_MASK)
#define S32_NVIC_IP_PRI92_MASK 0xFFu
#define S32_NVIC_IP_PRI92_SHIFT 0u
#define S32_NVIC_IP_PRI92_WIDTH 8u
#define S32_NVIC_IP_PRI92(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI92_SHIFT)) & S32_NVIC_IP_PRI92_MASK)
#define S32_NVIC_IP_PRI93_MASK 0xFFu
#define S32_NVIC_IP_PRI93_SHIFT 0u
#define S32_NVIC_IP_PRI93_WIDTH 8u
#define S32_NVIC_IP_PRI93(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI93_SHIFT)) & S32_NVIC_IP_PRI93_MASK)
#define S32_NVIC_IP_PRI94_MASK 0xFFu
#define S32_NVIC_IP_PRI94_SHIFT 0u
#define S32_NVIC_IP_PRI94_WIDTH 8u
#define S32_NVIC_IP_PRI94(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI94_SHIFT)) & S32_NVIC_IP_PRI94_MASK)
#define S32_NVIC_IP_PRI95_MASK 0xFFu
#define S32_NVIC_IP_PRI95_SHIFT 0u
#define S32_NVIC_IP_PRI95_WIDTH 8u
#define S32_NVIC_IP_PRI95(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI95_SHIFT)) & S32_NVIC_IP_PRI95_MASK)
#define S32_NVIC_IP_PRI96_MASK 0xFFu
#define S32_NVIC_IP_PRI96_SHIFT 0u
#define S32_NVIC_IP_PRI96_WIDTH 8u
#define S32_NVIC_IP_PRI96(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI96_SHIFT)) & S32_NVIC_IP_PRI96_MASK)
#define S32_NVIC_IP_PRI97_MASK 0xFFu
#define S32_NVIC_IP_PRI97_SHIFT 0u
#define S32_NVIC_IP_PRI97_WIDTH 8u
#define S32_NVIC_IP_PRI97(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI97_SHIFT)) & S32_NVIC_IP_PRI97_MASK)
#define S32_NVIC_IP_PRI98_MASK 0xFFu
#define S32_NVIC_IP_PRI98_SHIFT 0u
#define S32_NVIC_IP_PRI98_WIDTH 8u
#define S32_NVIC_IP_PRI98(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI98_SHIFT)) & S32_NVIC_IP_PRI98_MASK)
#define S32_NVIC_IP_PRI99_MASK 0xFFu
#define S32_NVIC_IP_PRI99_SHIFT 0u
#define S32_NVIC_IP_PRI99_WIDTH 8u
#define S32_NVIC_IP_PRI99(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI99_SHIFT)) & S32_NVIC_IP_PRI99_MASK)
#define S32_NVIC_IP_PRI100_MASK 0xFFu
#define S32_NVIC_IP_PRI100_SHIFT 0u
#define S32_NVIC_IP_PRI100_WIDTH 8u
#define S32_NVIC_IP_PRI100(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI100_SHIFT)) & S32_NVIC_IP_PRI100_MASK)
#define S32_NVIC_IP_PRI101_MASK 0xFFu
#define S32_NVIC_IP_PRI101_SHIFT 0u
#define S32_NVIC_IP_PRI101_WIDTH 8u
#define S32_NVIC_IP_PRI101(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI101_SHIFT)) & S32_NVIC_IP_PRI101_MASK)
#define S32_NVIC_IP_PRI102_MASK 0xFFu
#define S32_NVIC_IP_PRI102_SHIFT 0u
#define S32_NVIC_IP_PRI102_WIDTH 8u
#define S32_NVIC_IP_PRI102(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI102_SHIFT)) & S32_NVIC_IP_PRI102_MASK)
#define S32_NVIC_IP_PRI103_MASK 0xFFu
#define S32_NVIC_IP_PRI103_SHIFT 0u
#define S32_NVIC_IP_PRI103_WIDTH 8u
#define S32_NVIC_IP_PRI103(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI103_SHIFT)) & S32_NVIC_IP_PRI103_MASK)
#define S32_NVIC_IP_PRI104_MASK 0xFFu
#define S32_NVIC_IP_PRI104_SHIFT 0u
#define S32_NVIC_IP_PRI104_WIDTH 8u
#define S32_NVIC_IP_PRI104(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI104_SHIFT)) & S32_NVIC_IP_PRI104_MASK)
#define S32_NVIC_IP_PRI105_MASK 0xFFu
#define S32_NVIC_IP_PRI105_SHIFT 0u
#define S32_NVIC_IP_PRI105_WIDTH 8u
#define S32_NVIC_IP_PRI105(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI105_SHIFT)) & S32_NVIC_IP_PRI105_MASK)
#define S32_NVIC_IP_PRI106_MASK 0xFFu
#define S32_NVIC_IP_PRI106_SHIFT 0u
#define S32_NVIC_IP_PRI106_WIDTH 8u
#define S32_NVIC_IP_PRI106(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI106_SHIFT)) & S32_NVIC_IP_PRI106_MASK)
#define S32_NVIC_IP_PRI107_MASK 0xFFu
#define S32_NVIC_IP_PRI107_SHIFT 0u
#define S32_NVIC_IP_PRI107_WIDTH 8u
#define S32_NVIC_IP_PRI107(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI107_SHIFT)) & S32_NVIC_IP_PRI107_MASK)
#define S32_NVIC_IP_PRI108_MASK 0xFFu
#define S32_NVIC_IP_PRI108_SHIFT 0u
#define S32_NVIC_IP_PRI108_WIDTH 8u
#define S32_NVIC_IP_PRI108(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI108_SHIFT)) & S32_NVIC_IP_PRI108_MASK)
#define S32_NVIC_IP_PRI109_MASK 0xFFu
#define S32_NVIC_IP_PRI109_SHIFT 0u
#define S32_NVIC_IP_PRI109_WIDTH 8u
#define S32_NVIC_IP_PRI109(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI109_SHIFT)) & S32_NVIC_IP_PRI109_MASK)
#define S32_NVIC_IP_PRI110_MASK 0xFFu
#define S32_NVIC_IP_PRI110_SHIFT 0u
#define S32_NVIC_IP_PRI110_WIDTH 8u
#define S32_NVIC_IP_PRI110(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI110_SHIFT)) & S32_NVIC_IP_PRI110_MASK)
#define S32_NVIC_IP_PRI111_MASK 0xFFu
#define S32_NVIC_IP_PRI111_SHIFT 0u
#define S32_NVIC_IP_PRI111_WIDTH 8u
#define S32_NVIC_IP_PRI111(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI111_SHIFT)) & S32_NVIC_IP_PRI111_MASK)
#define S32_NVIC_IP_PRI112_MASK 0xFFu
#define S32_NVIC_IP_PRI112_SHIFT 0u
#define S32_NVIC_IP_PRI112_WIDTH 8u
#define S32_NVIC_IP_PRI112(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI112_SHIFT)) & S32_NVIC_IP_PRI112_MASK)
#define S32_NVIC_IP_PRI113_MASK 0xFFu
#define S32_NVIC_IP_PRI113_SHIFT 0u
#define S32_NVIC_IP_PRI113_WIDTH 8u
#define S32_NVIC_IP_PRI113(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI113_SHIFT)) & S32_NVIC_IP_PRI113_MASK)
#define S32_NVIC_IP_PRI114_MASK 0xFFu
#define S32_NVIC_IP_PRI114_SHIFT 0u
#define S32_NVIC_IP_PRI114_WIDTH 8u
#define S32_NVIC_IP_PRI114(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI114_SHIFT)) & S32_NVIC_IP_PRI114_MASK)
#define S32_NVIC_IP_PRI115_MASK 0xFFu
#define S32_NVIC_IP_PRI115_SHIFT 0u
#define S32_NVIC_IP_PRI115_WIDTH 8u
#define S32_NVIC_IP_PRI115(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI115_SHIFT)) & S32_NVIC_IP_PRI115_MASK)
#define S32_NVIC_IP_PRI116_MASK 0xFFu
#define S32_NVIC_IP_PRI116_SHIFT 0u
#define S32_NVIC_IP_PRI116_WIDTH 8u
#define S32_NVIC_IP_PRI116(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI116_SHIFT)) & S32_NVIC_IP_PRI116_MASK)
#define S32_NVIC_IP_PRI117_MASK 0xFFu
#define S32_NVIC_IP_PRI117_SHIFT 0u
#define S32_NVIC_IP_PRI117_WIDTH 8u
#define S32_NVIC_IP_PRI117(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI117_SHIFT)) & S32_NVIC_IP_PRI117_MASK)
#define S32_NVIC_IP_PRI118_MASK 0xFFu
#define S32_NVIC_IP_PRI118_SHIFT 0u
#define S32_NVIC_IP_PRI118_WIDTH 8u
#define S32_NVIC_IP_PRI118(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI118_SHIFT)) & S32_NVIC_IP_PRI118_MASK)
#define S32_NVIC_IP_PRI119_MASK 0xFFu
#define S32_NVIC_IP_PRI119_SHIFT 0u
#define S32_NVIC_IP_PRI119_WIDTH 8u
#define S32_NVIC_IP_PRI119(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI119_SHIFT)) & S32_NVIC_IP_PRI119_MASK)
#define S32_NVIC_IP_PRI120_MASK 0xFFu
#define S32_NVIC_IP_PRI120_SHIFT 0u
#define S32_NVIC_IP_PRI120_WIDTH 8u
#define S32_NVIC_IP_PRI120(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI120_SHIFT)) & S32_NVIC_IP_PRI120_MASK)
#define S32_NVIC_IP_PRI121_MASK 0xFFu
#define S32_NVIC_IP_PRI121_SHIFT 0u
#define S32_NVIC_IP_PRI121_WIDTH 8u
#define S32_NVIC_IP_PRI121(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI121_SHIFT)) & S32_NVIC_IP_PRI121_MASK)
#define S32_NVIC_IP_PRI122_MASK 0xFFu
#define S32_NVIC_IP_PRI122_SHIFT 0u
#define S32_NVIC_IP_PRI122_WIDTH 8u
#define S32_NVIC_IP_PRI122(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI122_SHIFT)) & S32_NVIC_IP_PRI122_MASK)
#define S32_NVIC_IP_PRI123_MASK 0xFFu
#define S32_NVIC_IP_PRI123_SHIFT 0u
#define S32_NVIC_IP_PRI123_WIDTH 8u
#define S32_NVIC_IP_PRI123(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI123_SHIFT)) & S32_NVIC_IP_PRI123_MASK)
#define S32_NVIC_IP_PRI124_MASK 0xFFu
#define S32_NVIC_IP_PRI124_SHIFT 0u
#define S32_NVIC_IP_PRI124_WIDTH 8u
#define S32_NVIC_IP_PRI124(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI124_SHIFT)) & S32_NVIC_IP_PRI124_MASK)
#define S32_NVIC_IP_PRI125_MASK 0xFFu
#define S32_NVIC_IP_PRI125_SHIFT 0u
#define S32_NVIC_IP_PRI125_WIDTH 8u
#define S32_NVIC_IP_PRI125(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI125_SHIFT)) & S32_NVIC_IP_PRI125_MASK)
#define S32_NVIC_IP_PRI126_MASK 0xFFu
#define S32_NVIC_IP_PRI126_SHIFT 0u
#define S32_NVIC_IP_PRI126_WIDTH 8u
#define S32_NVIC_IP_PRI126(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI126_SHIFT)) & S32_NVIC_IP_PRI126_MASK)
#define S32_NVIC_IP_PRI127_MASK 0xFFu
#define S32_NVIC_IP_PRI127_SHIFT 0u
#define S32_NVIC_IP_PRI127_WIDTH 8u
#define S32_NVIC_IP_PRI127(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI127_SHIFT)) & S32_NVIC_IP_PRI127_MASK)
#define S32_NVIC_IP_PRI128_MASK 0xFFu
#define S32_NVIC_IP_PRI128_SHIFT 0u
#define S32_NVIC_IP_PRI128_WIDTH 8u
#define S32_NVIC_IP_PRI128(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI128_SHIFT)) & S32_NVIC_IP_PRI128_MASK)
#define S32_NVIC_IP_PRI129_MASK 0xFFu
#define S32_NVIC_IP_PRI129_SHIFT 0u
#define S32_NVIC_IP_PRI129_WIDTH 8u
#define S32_NVIC_IP_PRI129(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI129_SHIFT)) & S32_NVIC_IP_PRI129_MASK)
#define S32_NVIC_IP_PRI130_MASK 0xFFu
#define S32_NVIC_IP_PRI130_SHIFT 0u
#define S32_NVIC_IP_PRI130_WIDTH 8u
#define S32_NVIC_IP_PRI130(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI130_SHIFT)) & S32_NVIC_IP_PRI130_MASK)
#define S32_NVIC_IP_PRI131_MASK 0xFFu
#define S32_NVIC_IP_PRI131_SHIFT 0u
#define S32_NVIC_IP_PRI131_WIDTH 8u
#define S32_NVIC_IP_PRI131(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI131_SHIFT)) & S32_NVIC_IP_PRI131_MASK)
#define S32_NVIC_IP_PRI132_MASK 0xFFu
#define S32_NVIC_IP_PRI132_SHIFT 0u
#define S32_NVIC_IP_PRI132_WIDTH 8u
#define S32_NVIC_IP_PRI132(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI132_SHIFT)) & S32_NVIC_IP_PRI132_MASK)
#define S32_NVIC_IP_PRI133_MASK 0xFFu
#define S32_NVIC_IP_PRI133_SHIFT 0u
#define S32_NVIC_IP_PRI133_WIDTH 8u
#define S32_NVIC_IP_PRI133(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI133_SHIFT)) & S32_NVIC_IP_PRI133_MASK)
#define S32_NVIC_IP_PRI134_MASK 0xFFu
#define S32_NVIC_IP_PRI134_SHIFT 0u
#define S32_NVIC_IP_PRI134_WIDTH 8u
#define S32_NVIC_IP_PRI134(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI134_SHIFT)) & S32_NVIC_IP_PRI134_MASK)
#define S32_NVIC_IP_PRI135_MASK 0xFFu
#define S32_NVIC_IP_PRI135_SHIFT 0u
#define S32_NVIC_IP_PRI135_WIDTH 8u
#define S32_NVIC_IP_PRI135(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI135_SHIFT)) & S32_NVIC_IP_PRI135_MASK)
#define S32_NVIC_IP_PRI136_MASK 0xFFu
#define S32_NVIC_IP_PRI136_SHIFT 0u
#define S32_NVIC_IP_PRI136_WIDTH 8u
#define S32_NVIC_IP_PRI136(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI136_SHIFT)) & S32_NVIC_IP_PRI136_MASK)
#define S32_NVIC_IP_PRI137_MASK 0xFFu
#define S32_NVIC_IP_PRI137_SHIFT 0u
#define S32_NVIC_IP_PRI137_WIDTH 8u
#define S32_NVIC_IP_PRI137(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI137_SHIFT)) & S32_NVIC_IP_PRI137_MASK)
#define S32_NVIC_IP_PRI138_MASK 0xFFu
#define S32_NVIC_IP_PRI138_SHIFT 0u
#define S32_NVIC_IP_PRI138_WIDTH 8u
#define S32_NVIC_IP_PRI138(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI138_SHIFT)) & S32_NVIC_IP_PRI138_MASK)
#define S32_NVIC_IP_PRI139_MASK 0xFFu
#define S32_NVIC_IP_PRI139_SHIFT 0u
#define S32_NVIC_IP_PRI139_WIDTH 8u
#define S32_NVIC_IP_PRI139(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI139_SHIFT)) & S32_NVIC_IP_PRI139_MASK)
#define S32_NVIC_IP_PRI140_MASK 0xFFu
#define S32_NVIC_IP_PRI140_SHIFT 0u
#define S32_NVIC_IP_PRI140_WIDTH 8u
#define S32_NVIC_IP_PRI140(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI140_SHIFT)) & S32_NVIC_IP_PRI140_MASK)
#define S32_NVIC_IP_PRI141_MASK 0xFFu
#define S32_NVIC_IP_PRI141_SHIFT 0u
#define S32_NVIC_IP_PRI141_WIDTH 8u
#define S32_NVIC_IP_PRI141(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI141_SHIFT)) & S32_NVIC_IP_PRI141_MASK)
#define S32_NVIC_IP_PRI142_MASK 0xFFu
#define S32_NVIC_IP_PRI142_SHIFT 0u
#define S32_NVIC_IP_PRI142_WIDTH 8u
#define S32_NVIC_IP_PRI142(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI142_SHIFT)) & S32_NVIC_IP_PRI142_MASK)
#define S32_NVIC_IP_PRI143_MASK 0xFFu
#define S32_NVIC_IP_PRI143_SHIFT 0u
#define S32_NVIC_IP_PRI143_WIDTH 8u
#define S32_NVIC_IP_PRI143(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI143_SHIFT)) & S32_NVIC_IP_PRI143_MASK)
#define S32_NVIC_IP_PRI144_MASK 0xFFu
#define S32_NVIC_IP_PRI144_SHIFT 0u
#define S32_NVIC_IP_PRI144_WIDTH 8u
#define S32_NVIC_IP_PRI144(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI144_SHIFT)) & S32_NVIC_IP_PRI144_MASK)
#define S32_NVIC_IP_PRI145_MASK 0xFFu
#define S32_NVIC_IP_PRI145_SHIFT 0u
#define S32_NVIC_IP_PRI145_WIDTH 8u
#define S32_NVIC_IP_PRI145(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI145_SHIFT)) & S32_NVIC_IP_PRI145_MASK)
#define S32_NVIC_IP_PRI146_MASK 0xFFu
#define S32_NVIC_IP_PRI146_SHIFT 0u
#define S32_NVIC_IP_PRI146_WIDTH 8u
#define S32_NVIC_IP_PRI146(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI146_SHIFT)) & S32_NVIC_IP_PRI146_MASK)
#define S32_NVIC_IP_PRI147_MASK 0xFFu
#define S32_NVIC_IP_PRI147_SHIFT 0u
#define S32_NVIC_IP_PRI147_WIDTH 8u
#define S32_NVIC_IP_PRI147(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI147_SHIFT)) & S32_NVIC_IP_PRI147_MASK)
#define S32_NVIC_IP_PRI148_MASK 0xFFu
#define S32_NVIC_IP_PRI148_SHIFT 0u
#define S32_NVIC_IP_PRI148_WIDTH 8u
#define S32_NVIC_IP_PRI148(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI148_SHIFT)) & S32_NVIC_IP_PRI148_MASK)
#define S32_NVIC_IP_PRI149_MASK 0xFFu
#define S32_NVIC_IP_PRI149_SHIFT 0u
#define S32_NVIC_IP_PRI149_WIDTH 8u
#define S32_NVIC_IP_PRI149(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI149_SHIFT)) & S32_NVIC_IP_PRI149_MASK)
#define S32_NVIC_IP_PRI150_MASK 0xFFu
#define S32_NVIC_IP_PRI150_SHIFT 0u
#define S32_NVIC_IP_PRI150_WIDTH 8u
#define S32_NVIC_IP_PRI150(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI150_SHIFT)) & S32_NVIC_IP_PRI150_MASK)
#define S32_NVIC_IP_PRI151_MASK 0xFFu
#define S32_NVIC_IP_PRI151_SHIFT 0u
#define S32_NVIC_IP_PRI151_WIDTH 8u
#define S32_NVIC_IP_PRI151(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI151_SHIFT)) & S32_NVIC_IP_PRI151_MASK)
#define S32_NVIC_IP_PRI152_MASK 0xFFu
#define S32_NVIC_IP_PRI152_SHIFT 0u
#define S32_NVIC_IP_PRI152_WIDTH 8u
#define S32_NVIC_IP_PRI152(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI152_SHIFT)) & S32_NVIC_IP_PRI152_MASK)
#define S32_NVIC_IP_PRI153_MASK 0xFFu
#define S32_NVIC_IP_PRI153_SHIFT 0u
#define S32_NVIC_IP_PRI153_WIDTH 8u
#define S32_NVIC_IP_PRI153(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI153_SHIFT)) & S32_NVIC_IP_PRI153_MASK)
#define S32_NVIC_IP_PRI154_MASK 0xFFu
#define S32_NVIC_IP_PRI154_SHIFT 0u
#define S32_NVIC_IP_PRI154_WIDTH 8u
#define S32_NVIC_IP_PRI154(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI154_SHIFT)) & S32_NVIC_IP_PRI154_MASK)
#define S32_NVIC_IP_PRI155_MASK 0xFFu
#define S32_NVIC_IP_PRI155_SHIFT 0u
#define S32_NVIC_IP_PRI155_WIDTH 8u
#define S32_NVIC_IP_PRI155(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI155_SHIFT)) & S32_NVIC_IP_PRI155_MASK)
#define S32_NVIC_IP_PRI156_MASK 0xFFu
#define S32_NVIC_IP_PRI156_SHIFT 0u
#define S32_NVIC_IP_PRI156_WIDTH 8u
