rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_NVIC.h
#define S32_NVIC_IP_PRI236(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI236_SHIFT)) & S32_NVIC_IP_PRI236_MASK)
#define S32_NVIC_IP_PRI237_MASK 0xFFu
#define S32_NVIC_IP_PRI237_SHIFT 0u
#define S32_NVIC_IP_PRI237_WIDTH 8u
#define S32_NVIC_IP_PRI237(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI237_SHIFT)) & S32_NVIC_IP_PRI237_MASK)
#define S32_NVIC_IP_PRI238_MASK 0xFFu
#define S32_NVIC_IP_PRI238_SHIFT 0u
#define S32_NVIC_IP_PRI238_WIDTH 8u
#define S32_NVIC_IP_PRI238(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI238_SHIFT)) & S32_NVIC_IP_PRI238_MASK)
#define S32_NVIC_IP_PRI239_MASK 0xFFu
#define S32_NVIC_IP_PRI239_SHIFT 0u
#define S32_NVIC_IP_PRI239_WIDTH 8u
#define S32_NVIC_IP_PRI239(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI239_SHIFT)) & S32_NVIC_IP_PRI239_MASK)
/* STIR Bit Fields */
#define S32_NVIC_STIR_INTID_MASK 0x1FFu
#define S32_NVIC_STIR_INTID_SHIFT 0u
#define S32_NVIC_STIR_INTID_WIDTH 9u
#define S32_NVIC_STIR_INTID(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << S32_NVIC_STIR_INTID_SHIFT)) & S32_NVIC_STIR_INTID_MASK)

/*!
 * @}
 */ /* end of group S32_NVIC_Register_Masks */

/*!
 * @}
 */ /* end of group S32_NVIC_Peripheral_Access_Layer */

#endif /* #if !defined(S32M24x_NVIC_H_) */
